doc/2015RoboticsCompetition.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Robotics Merit Badge Class Competition:  Robotic Uranium Carry</title>
<!-- 2015-07-19 Sun 22:36 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Maurice Ling" />
</head>
<body>
<div id="content">
<h1 class="title">Robotics Merit Badge Class Competition:  Robotic Uranium Carry</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Competition Time, Date and Location</a></li>
<li><a href="#sec-2">2. Summary</a></li>
<li><a href="#sec-3">3. Terminology</a></li>
<li><a href="#sec-4">4. Competition Specifications</a>
<ul>
<li><a href="#sec-4-1">4.1. Hardware</a></li>
<li><a href="#sec-4-2">4.2. Programming</a></li>
<li><a href="#sec-4-3">4.3. Time for Completion</a></li>
<li><a href="#sec-4-4">4.4. Payload</a></li>
<li><a href="#sec-4-5">4.5. Loading/Unloading</a></li>
<li><a href="#sec-4-6">4.6. Transport Course</a></li>
<li><a href="#sec-4-7">4.7. Documentation</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Teamwork (optional)</a></li>
<li><a href="#sec-6">6. Scoring</a></li>
<li><a href="#sec-7">7. Judge Panel</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Competition Time, Date and Location</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Location:  Light of Christ Church Fellowship Hall
</li>
<li>Date:  August 30, 2015
</li>
<li>Time:
<ul class="org-ul">
<li>6:00 pm setup
</li>
<li>6:30 pm Judges' Design Reviews
</li>
<li>7:00 pm Competition Start.
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Summary</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Transport radioactive uranium payload from one reactor to another.
</li>
<li>Uranium payload will take the form of a ping pong ball.
</li>
<li>Begin and end with a human-controlled segment to load and unload
the payload.
</li>
<li>Autonomously navigate a transport course between the load and unloading areas.
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Terminology</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>We shall refer to the humans participating in the competition as the <i>participant(s)</i>
     and the device as the <i>robot</i>.
</li>
<li>The <i>payload</i> refers to the ping pong ball in the competition.
</li>
<li>The <i>competition</i> refers to each participator's performance in the 
competition course.
</li>
<li>The <i>over-all competition</i> refers to the entire competition with all participants.
</li>
<li>The participant's <i>entry</i> into the competition includes the hardware, software (program), 
and documentation (Engineering Notebook)
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Competition Specifications</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Hardware</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li>The robot shall be programmable by the participant(s).
</li>
<li>The robot shall use one or more processors/boards
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Programming</h3>
<div class="outline-text-3" id="text-4-2">
<ol class="org-ol">
<li>The robot shall not be re-programmed while the robot is in the competition course.
</li>
<li>The source code for the robots must be available for judges to review.
</li>
<li>The participant may utilize libraries in the program.
</li>
<li>If code is copy and pasted from third party sources, the reference must be
attributed in the code comments.
</li>
<li>The core code and logic must be written by the participant
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Time for Completion</h3>
<div class="outline-text-3" id="text-4-3">
<ol class="org-ol">
<li>The robot shall complete the course in maximum of 5 minutes.
</li>
<li>Bonus points shall be awarded for time achieved under 3 minutes.
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Payload</h3>
<div class="outline-text-3" id="text-4-4">
<ol class="org-ol">
<li>The payload shall be a regulation (non-radioactive) ping pong ball with a diameter
of 40mm
</li>
<li>The payload shall not be directly touched by the participant.
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Loading/Unloading</h3>
<div class="outline-text-3" id="text-4-5">
<ol class="org-ol">
<li>The robot shall load payload from an 3 inch high elevated platform.
</li>
<li>The robot shall unload the payload onto a 3-inch high elevated platform.
</li>
<li>Loading and unloading may be done using manual (human-directed or controlled
mechanisms).
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> Transport Course</h3>
<div class="outline-text-3" id="text-4-6">
<ol class="org-ol">
<li>The transport course will be navigated autonomously by the robot.
</li>
<li>The payload shall remain with the robot during transport
</li>
<li>The participant shall not manually intervene while the robot is within
the transport course.
</li>
<li>The robot shall not make contact with walls or objects within the 
transport course.
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> Documentation</h3>
<div class="outline-text-3" id="text-4-7">
<p>
Designs must be documented in your Engineering Notebook and include:
</p>
<ol class="org-ol">
<li>Programming logic
</li>
<li>Mechanical/Physical design diagrams/sketches
</li>
<li>Circuit diagram
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Teamwork (optional)</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>A scout may team up with one other scout. 
</li>
<li>Team must be decided by the end of the 2nd class.
</li>
<li>Each member of the team must understand how the entire robot operates.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Scoring</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>Completion of each segment (Load, transport, Unload) shall be +20 points.
</li>
<li>Complete design documentation in Engineering Notebook up to +20 points
awarded as follows:
<ol class="org-ol">
<li>Programming logic (+5)
</li>
<li>Physical design (+5)
</li>
<li>Circuit/Electrical design (+5)
</li>
<li>Neatness/organization (+5)
</li>
</ol>
</li>
<li>Bonus Points
<ol class="org-ol">
<li>Time Bonus
<ul class="org-ul">
<li>+10 for under 3 minutes
</li>
<li>+20 for under 2 minutes
</li>
<li>+30 for under 1 minute
</li>
</ul>
</li>
<li>Up to +20 points for elegant and innovative design
</li>
</ol>
</li>
<li>Point Deductions
<ol class="org-ol">
<li>Each manual intervention by the participant during transport (-5)
</li>
<li>Each payload touch by the participant (-5)
</li>
</ol>
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Judge Panel</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li>Scoring shall be done by an imparital judge panel.
</li>
<li>Each judge will score the competitions individually, making appropriate notes.
</li>
<li>30 minutes prior to the beginning of the over-all competition, the judges will individually
review each the participant's entries ask the participants questions.
Time spent with each participant shall not exceed 3 minutes.
</li>
<li>At the completion of each competition, the judges will spend up to 2 minutes to 
agree on the final score for the participant.
</li>
<li>Judges will be selected by the Merit Badge Counselor.
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2015-07-20</p>
<p class="author">Author: Maurice Ling</p>
<p class="date">Created: 2015-07-19 Sun 22:36</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
